cats_project/app/controllers/cats_controller.rb

INSERT INTO "cats" ("name", "sex", "color", "birth_date", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @cat = Cat.new(cat_params)
        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "description" = $2, "birth_date" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["name", "Vicki Zhi"], ["description", "Best Sister \r\n        "], ["birth_date", "2022-05-05"], ["updated_at", "2022-05-07 18:21:03.599513"], ["id", 12]]
---
    def update
        @cat = Cat.find(params[:id])
        if @cat.update_attributes(cat_params)